# -*- coding: utf-8 -*-
# @Project: 芒果测试平台
# @Description: 
# @Time   : 2023-08-11 11:08
# @Author : 毛鹏
from enums.tools_enum import SourcesTypeEnum

# -------------------------------------是否开启调试-------------------------------------
IS_DEBUG = False

# ---------------------------------是否在运行结束后生成报告--------------------------------
IS_TEST_REPORT = True

# -------------------------------------API自动化配置-------------------------------------

PRINT_EXECUTION_RESULTS = True  # 是否开启日志打印
REQUEST_TIMEOUT_FAILURE_TIME = 60  # 请求超时失败时间

# --------------------------------------UI自动化配置-------------------------------------

BROWSER_IS_MAXIMIZE = True  # 是否开启UI自动化浏览器全屏

# --------------------------------------数据源选择--------------------------------------

SOURCES_TYPE = SourcesTypeEnum.EXCEL

# ----------------------------------------邮件配置---------------------------------------

EMAIL_HOST = 'smtp.qq.com'  # 发送邮件host，这个是QQ邮箱
SEND_USER = '729164035@qq.com'  # 发送用户
STAMP_KEY = 'trwymxhsefpobdba'  # 用户的key

# ------------------------------------全局请求代理设置------------------------------------

PROXY = {}  # 代理地址，如果没有就是空字典

# ---------------------------------------用户配置---------------------------------------
USER_CONFIG = {
    'mao_peng': {''}
}
